int/resources/objectRepo/xmlTemplates/opera/LOV/req_FetchListOfValues.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:FetchListOfValuesRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:Criteria IncludeInactive="?" LOVName="?">
            <v91:Parameters>
               <v91:Parameter>
                  <v91:ParameterName/>
                  <v91:ParameterValue/>
               </v91:Parameter>
            </v91:Parameters>
            <v91:ItemCodes/>
            <v91:ExcludeCodeList>
               <v91:Code/>
            </v91:ExcludeCodeList>
         </v9:Criteria>
      </v9:FetchListOfValuesRQ>
   </soapenv:Body>
</soapenv:Envelope>